{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\n",
    "启动数据库服务器\n",
    "```bash\n",
    "bash /mnt/petrelfs/songmingyang/code/mm/robustLMM/robustlmm/analysis/longTail/language_level/db/start_neo4j.sh\n",
    "```\n",
    "\n",
    "shell启动 odbc\n",
    "```bash\n",
    "cypher-shell  -a neo4j://10.140.54.10:7687  -u neo4j -p 12345678\n",
    "```\n",
    "数据库操作\n",
    "```sql\n",
    "CREATE DATABASE XXX;\n",
    ":use XXX;\n",
    "CREATE DATABASE lcs558kPos;\n",
    "CREATE DATABASE instructmix665kPos;\n",
    "```\n",
    "\n",
    "数据操作\n",
    "```sql\n",
    "CREATE CONSTRAINT FOR (n:WORD) REQUIRE n.lemma IS UNIQUE;\n",
    "\n",
    "MERGE (n:WORD { lemma: 'test' })\n",
    "ON CREATE SET n.count = 1\n",
    "ON MATCH SET n.count = n.count + 1;\n",
    "\n",
    "\n",
    "MERGE (a:WORD { lemma:'test' })\n",
    "ON CREATE SET a.count = 1\n",
    "MERGE (b:WORD { lemma:'test1' })\n",
    "ON CREATE SET b.count = 1\n",
    "MERGE (a)-[r:CO_OCCURRENCE]->(b)\n",
    "ON CREATE SET r.count = 0\n",
    "WITH a,b,r\n",
    "SET r.count = r.count + 1;\n",
    "\n",
    "\n",
    "```\n",
    "常用查询\n",
    "\n",
    "```sql\n",
    "\n",
    "MATCH (n) DETACH DELETE n;\n",
    "MATCH (n) RETURN n;\n",
    "MATCH (n) RETURN COUNT(n);\n",
    "MATCH (a)-[r:CO_OCCURRENCE]->(b) RETURN r;\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import psycopg2\n",
    "\n",
    "uri = \"neo4j://10.140.54.12:7687\"\n",
    "db_name=\"instructmix665kllama\"\n",
    "chart_length=20"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Neo4j Kernel version :5.19.0\n"
     ]
    }
   ],
   "source": [
    "# Test connection to Neo4j\n",
    "\n",
    "driver = GraphDatabase.driver(uri, auth=(\"neo4j\", \"12345678\"))\n",
    "gds_version_query = \"call dbms.components() yield name, versions, edition unwind versions as version return name, version, edition;\"\n",
    "with driver.session() as session:\n",
    "    results = session.run(gds_version_query).data()\n",
    "    print (\"Neo4j Kernel version :\" + str(results[0]['version']))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 先画出节点的top20"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "# token_level\n",
    "token_level = 1\n",
    "\n",
    "lcs=\"lcs558k\"\n",
    "lcs_dedup = \"lcs558k_deduplicate\"\n",
    "pope=\"pope\"\n",
    "pope_dedup = \"pope_deduplicate\"\n",
    "mme=\"mme\"\n",
    "mme_dedup = \"mme_deduplicate\"\n",
    "instruct = \"instructmix665k\"\n",
    "instruct_dedup = \"instructmix665k_deduplicate\"\n",
    "db_dict=dict(database='language_level_word_count',user='songmingyang',password='123456',host='SH-IDCA1404-10-140-54-7',port='5432')\n",
    "\n",
    "def connect_db(db_dict):\n",
    "        conn = psycopg2.connect(**db_dict)\n",
    "        cursor = conn.cursor()\n",
    "        return conn,cursor\n",
    "    \n",
    "def fetch_table_data(table_name):\n",
    "        conn,cursor = connect_db(db_dict)\n",
    "        # cursor.execute(f\"SELECT * FROM {table_name} ORDER BY count DESC;\")\n",
    "        cursor.execute(f\"SELECT * FROM {table_name} ORDER BY count ASC;\")\n",
    "        data = cursor.fetchall()\n",
    "        conn.close()\n",
    "        return data\n",
    "    \n",
    "\n",
    "instruct_mix_data = fetch_table_data(instruct)\n",
    "instruct_mix_data = [item for item in instruct_mix_data if item[1] >= 10]\n",
    "token_level_data = instruct_mix_data[:20]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "# vision level \n",
    "query = \"match (n) return n;\"\n",
    "visual_db_name = \"instructmix665kvisualobj\"\n",
    "# query = \"match (a)-[r:CO_OCCURRENCE]->(b) return a.lemma, r.count, b.lemma;\"\n",
    "with driver.session(database=visual_db_name) as session:\n",
    "    results = session.run(query).data()\n",
    "# results.sort(key=lambda x: x['n']['count'], reverse=True)\n",
    "results.sort(key=lambda x: x['n']['count'],)\n",
    "vision_level_data_before = [(x['n']['lemma'], x['n']['count']) for x in results]\n",
    "vision_level_data = []\n",
    "while len(vision_level_data) < chart_length:\n",
    "    item = vision_level_data_before.pop(0)\n",
    "    if item[1]<10:\n",
    "        continue\n",
    "    if item[0] not in [x[0] for x in vision_level_data]+ ['',' ']:\n",
    "        vision_level_data.append(item)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "# what_word level\n",
    "from mhr.utils.utils import process_jsonl\n",
    "what_word_file = \"/mnt/petrelfs/songmingyang/songmingyang/data/llava_train/LLaVA-Instruct-150K/llava_v1_5_mix665k_what_word_llama.jsonl\"\n",
    "what_word_data = process_jsonl(what_word_file)\n",
    "word_cnt_list = []\n",
    "for item in what_word_data:\n",
    "    what_words = item['objects'].strip().split(',')\n",
    "    word_cnt_list.extend(what_words)\n",
    "word_cnt_dict = {}\n",
    "for word in word_cnt_list:\n",
    "    if word in word_cnt_dict:\n",
    "        word_cnt_dict[word] += 1\n",
    "    else:\n",
    "        word_cnt_dict[word] = 1\n",
    "\n",
    "word_cnt_list = [(k,v) for k,v in word_cnt_dict.items()]\n",
    "# word_cnt_list.sort(key=lambda x:x[1],reverse=True)\n",
    "word_cnt_list.sort(key=lambda x:x[1],)\n",
    "what_word_data = []\n",
    "while len(what_word_data) < chart_length:\n",
    "    item = word_cnt_list.pop(0)\n",
    "    if item[1]<10:\n",
    "        continue\n",
    "    if item[0] not in ['',' ']+[x[0] for x in what_word_data]:\n",
    "        what_word_data.append(item)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "# co occurrence level\n",
    "# query = \"match (n) return n;\"\n",
    "visual_db_name = \"instructmix665kvisualobj\"\n",
    "query = \"match (a)-[r:CO_OCCURRENCE]->(b) return a.lemma, r.count, b.lemma;\"\n",
    "with driver.session(database=visual_db_name) as session:\n",
    "    results = session.run(query).data()\n",
    "# results.sort(key=lambda x: x['r.count'], reverse=True)\n",
    "results.sort(key=lambda x: x['r.count'])\n",
    "co_occurrence_data_before = [(f\"{x['a.lemma']}, {x['b.lemma']}\", x['r.count'] ) for x in results]\n",
    "co_occurrence_data = []\n",
    "while len(co_occurrence_data) < chart_length:\n",
    "    item = co_occurrence_data_before.pop(0)\n",
    "    if item[1]<10:\n",
    "        continue\n",
    "    if item[0] not in [x[0] for x in co_occurrence_data]+ ['',' ']:\n",
    "        co_occurrence_data.append(item)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "scissors one & 10 & ParkingIs & 10 & what animals & 10 & plane airplane, water lake  & 10  \\\\ \n",
      "father groom & 10 & ShoesWhich & 10 & what content & 10 & stovetop stove, window  & 10  \\\\ \n",
      "street highway road & 10 & BermudaWhat & 10 & be same & 10 & bowl dish, silverware  & 10  \\\\ \n",
      "eating meat & 10 & reagan & 10 & can you list & 10 & groom husband, tie  & 10  \\\\ \n",
      "plant palm tree & 10 & BambooWhat & 10 & what orientation & 10 & bat, road street  & 10  \\\\ \n",
      "woman grooming & 10 & polewhere & 10 & what purposes & 10 & net, one player  & 10  \\\\ \n",
      "man up & 10 & ballwhich & 10 & purpose & 10 & street, woman front  & 10  \\\\ \n",
      "cafe establishment & 10 & UmbrellaWhy & 10 & could you describe & 10 & attire clothing, bus  & 10  \\\\ \n",
      "colleague lady & 10 & snowis & 10 & what gesture & 10 & boat, lake waterway  & 10  \\\\ \n",
      "home museum & 10 & Crichton & 10 & does he have & 10 & microphone, suit attire  & 10  \\\\ \n",
      "instructor trainer & 10 & hourglass & 10 & what indication & 10 & glasses, suit attire  & 10  \\\\ \n",
      "official coach umpire & 10 & Alfalfa & 10 & what conditions & 10 & adult instructor, clothing  & 10  \\\\ \n",
      "scarf ribbon & 10 & stopdo & 10 & what indicate & 10 & uniform clothes, woman  & 10  \\\\ \n",
      "blanket sheets & 10 & storyWhat & 10 & what placement & 10 & flower, utens fork  & 10  \\\\ \n",
      "racketcquetcquet & 10 & DaisyIs & 10 & what structure & 10 & man father, umbrella  & 10  \\\\ \n",
      "red shirt woman & 10 & GoatsHow & 10 & what specifically & 10 & arm, clothing attire  & 10  \\\\ \n",
      "spoonens & 10 & rustic & 10 & what might have & 10 & player member, woman  & 10  \\\\ \n",
      "ki kiwi & 10 & joiner & 10 & what can we infer & 10 & field grass, giraffe giraffes  & 10  \\\\ \n",
      "figuri toy & 10 & CleanOn & 10 & what have & 10 & adult man, umbrella  & 10  \\\\ \n",
      "male skateboarder & 10 & Sherwood & 10 & what tool & 10 & clothing attire, soccer  & 10  \\\\ \n",
      "\n"
     ]
    }
   ],
   "source": [
    "res = \"\"\n",
    "for i  in range(chart_length):\n",
    "    res+= f\"{vision_level_data[i][0]} & {vision_level_data[i][1] :.0f} & {token_level_data[i][0]} & {token_level_data[i][1] :.0f} & {what_word_data[i][0]} & {what_word_data[i][1]:.0f} & {co_occurrence_data[i][0]}  & {co_occurrence_data[i][1] :.0f}  \\\\\\\\ \\n\"\n",
    "    \n",
    "    # res+= f\"{vision_level_data[i][0]} & {vision_level_data[i][1]/1000 :.0f}K & {token_level_data[i][0]} & {token_level_data[i][1]/1000 :.0f}K & {what_word_data[i][0]} & {what_word_data[i][1]/1000:.0f}K & {co_occurrence_data[i][0]}  & {co_occurrence_data[i][1]/1000 :.0f}K   \\\\\\\\ \\n\"\n",
    "    \n",
    "print(res)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "lt",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
